a:3:{s:4:"time";i:1381329273;s:3:"ttl";i:600;s:5:"value";a:28:{s:4:"name";s:13:"Shop-Script 5";s:7:"version";s:11:"5.1.9.25102";s:15:"update_datetime";s:19:"2013-09-26 04:41:09";s:7:"license";s:20:"Commercial, Webasyst";s:11:"license_url";s:35:"http://www.webasyst.com/terms/#eula";s:12:"license_text";N;s:7:"summary";s:51:"Создание интернет-магазина.";s:4:"icon";s:61:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.png";s:5:"icons";a:4:{i:96;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.96x96.png";i:48;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.48x48.png";i:24;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.24x24.png";i:16;s:67:"//www.webasyst.com/wa-data/public/updates/img/29/129/icon.16x16.png";}s:6:"vendor";s:8:"webasyst";s:11:"vendor_name";s:8:"Webasyst";s:7:"support";s:0:"";s:3:"url";s:25:"http://www.shop-script.ru";s:8:"demo_url";s:27:"http://demo-ru.webasyst.com";s:10:"commercial";b:1;s:9:"purchased";N;s:12:"purchase_url";s:33:"https://www.webasyst.com/my/apps/";s:14:"license_expire";N;s:5:"price";s:13:"9 999 руб.";s:11:"lease_price";s:11:"599 руб.";s:11:"description";s:440:"В Shop-Script 5 есть все, что нужно для открытия интернет-магазина: более 250 полезных функций, которые позволят вам продавать больше. Shop-Script 5 является одним из самых функциональных скриптов интернет-магазина для малого и среднего бизнеса в рунете.";s:11:"screenshots";a:5:{i:0;a:3:{s:11:"description";N;s:5:"thumb";s:72:"http://www.webasyst.com/wa-data/public/updates/img/29/129/133/133.70.jpg";s:3:"img";s:73:"http://www.webasyst.com/wa-data/public/updates/img/29/129/133/133.750.jpg";}i:1;a:3:{s:11:"description";N;s:5:"thumb";s:72:"http://www.webasyst.com/wa-data/public/updates/img/29/129/134/134.70.png";s:3:"img";s:73:"http://www.webasyst.com/wa-data/public/updates/img/29/129/134/134.750.png";}i:2;a:3:{s:11:"description";N;s:5:"thumb";s:72:"http://www.webasyst.com/wa-data/public/updates/img/29/129/135/135.70.png";s:3:"img";s:73:"http://www.webasyst.com/wa-data/public/updates/img/29/129/135/135.750.png";}i:3;a:3:{s:11:"description";N;s:5:"thumb";s:72:"http://www.webasyst.com/wa-data/public/updates/img/29/129/136/136.70.png";s:3:"img";s:73:"http://www.webasyst.com/wa-data/public/updates/img/29/129/136/136.750.png";}i:4;a:3:{s:11:"description";N;s:5:"thumb";s:72:"http://www.webasyst.com/wa-data/public/updates/img/29/129/137/137.70.png";s:3:"img";s:73:"http://www.webasyst.com/wa-data/public/updates/img/29/129/137/137.750.png";}}s:5:"pages";a:0:{}s:9:"changelog";a:40:{i:0;a:2:{s:7:"version";s:11:"5.1.9.25102";s:7:"content";s:96:"Различные улучшения и исправления найденных ошибок.";}i:1;a:2:{s:7:"version";s:11:"5.1.9.24470";s:7:"content";s:85:"Исправлена ошибка в работе отчетов о продажах.";}i:2;a:2:{s:7:"version";s:11:"5.1.9.24400";s:7:"content";s:1165:"<ul>
  <li>В настройки полей контактной информации добавлена возможность создания пользовательских полей типа «Флажок» (checkbox).</li>
  <li>Добавлен запрет на кеширование содержимого страницы корзины.</li>
  <li>Исправлены ошибки, возникавшие при сохранении характеристик товаров.</li>
  <li>Исправлена ошибка формирования печатной формы платежного документа при попытке доступа к ней неавторизованным покупателем с использованием PIN-кода.</li>
  <li>Исправлены ошибки в работе отчета о продажах.</li>
  <li>Исправлена работа метода <code>$wa->shop->categories()</code>.</li>
  <li>Исправлено ошибочное добавление подкатегорий скрытой родительской категории в файл Sitemap.</li>
</ul>";}i:3;a:2:{s:7:"version";s:11:"5.1.9.23952";s:7:"content";s:601:"<ul>
<li>Исправлена работа функции <code>{$wa->shop->categories()}</code>.</li>
<li>Исправлена обработка хука <code>backend_settings_discounts</code>.</li>
<li>Исправлена ошибка импорта категорий товаров из CSV-файла, приводившая к появлению дублей категорий .</li>
<li>Исправлено отображение зачеркнутой цены на витрине, если она меньше или равна основной цене артикула.</li>
</ul>";}i:4;a:2:{s:7:"version";s:11:"5.1.9.23928";s:7:"content";s:312:"<ul>
<li>Исправлена обработка ответа от платежных систем.</li>
<li>Исправлена ошибка получения списка способов доставки при создании и редактировании заказа в бекенде.</li>
</ul>
";}i:5;a:2:{s:7:"version";s:11:"5.1.9.23918";s:7:"content";s:959:"<ul>
<li>Реализовано применение параметра «Включить товары из подкатегорий» при просмотре категорий товаров в бекенде.</li>
<li>Добавлена возможность изменения ширины левой боковой панели в разделе «Товары».</li>
<li>Улучшен интерфейс настройки категорий товаров.</li>
<li>Исправлена ошибка отображения на витрине подкатегорий, вложенных в скрытую родительскую категорию.</li>
<li>Добавлены новые хуки, включая <code>backend_settings_discounts</code> и <code>order_calculate_discount</code> — для создания плагинов расчета скидок.</li>
<li>Исправление мелких ошибок.</li>
</ul>";}i:6;a:2:{s:7:"version";s:11:"5.1.9.23733";s:7:"content";s:236:"<ul>
<li>Исправление ошибок</li>
<li>В настройках рекомендуемых товаров добавлена возможность указывать условие на тип товаров</li>
</ul>";}i:7;a:2:{s:7:"version";s:11:"5.1.9.23717";s:7:"content";s:1007:"<ul>
<li>Добавлена возможность отображения категорий товаров на любых выбранных витринах.</li>
<li>Добавлено автоматическое перенаправление покупателя на сайт платежной системы для оплаты заказа.</li>
<li>Добавлены новые хуки для разработки плагинов: order_calculate_discount, category_save, category_delete, backend_category_dialog, backend_products, а также хуки для действий с заказами: order_action.create, order_action.pay и т. п.</li>
<li>Исправлена ошибка редактирования заказов с товарами, отсутствующими на складе.</li>
<li>Исправлены недочеты импорта товаров из CSV-файла.</li>
<li>Исправление других мелких ошибок.</li>
</ul>";}i:8;a:2:{s:7:"version";s:11:"5.1.9.23604";s:7:"content";s:1982:"<ul>
<li>Добавлены новые типы многомерных характеристик товаров: «Значение х Значение» и «Значение х Значение х Значение» (для указания размера экрана или габаритов упаковки и других подобных параметров).</li>
<li>Доработан механизм обработки обратных вызовов от платежных систем: теперь они фиксируются в логе обработки заказа</li>
<li>Для разработчиков: в дополнение к методу callbackPaymentHandler() модулей оплаты добавлены методы для действий Cancel, Auth, Capture, Refund, Decline, Chargeback.</li>
<li>Для разработчиков: добавлена возможность выборки списков товаров по значениям характеристик (пример хеша для формирования коллекции: <code>search/brand=Samsung</code>).</li>
<li>Исправлена печать форм №113 и №116 в Internet Explorer 9.</li>
<li>Исправлены ошибки отображения товаров во вложенных динамических категориях.</li>
<li>Исправлена отображение списка подкатегорий на странице родительской категории на разных витринах.</li>
<li>Исправлено некорректное отображение личного кабинета покупателя в нескольких темах дизайна.</li>
<li>Исправлена печать заказов с большим списком товаров в браузерах Firefox и Opera.</li>
<li>Исправление других недочетов.</li>
</ul>";}i:9;a:2:{s:7:"version";s:11:"5.1.9.23480";s:7:"content";s:416:"<ul>
<li>Добавлен новый тип характеристик товаров «диапазон».</li>
<li>Исправлены ошибки в разделе управления характеристиками товаров.</li>
<li>Исправлены ошибки в работе модуля оплаты WorldPay.</li>
<li>Исправление мелких недочетов.</li>
</ul>
";}i:10;a:2:{s:7:"version";s:11:"5.1.9.23418";s:7:"content";s:137:"Оптимизация запросов, исправление незначительных ошибок, общие улучшения.";}i:11;a:2:{s:7:"version";s:11:"5.1.9.23391";s:7:"content";s:74:"Незначительные исправления и улучшения.";}i:12;a:2:{s:7:"version";s:11:"5.1.9.23377";s:7:"content";s:1254:"— Интеграция с соцсетями «ВКонтакте» и Facebook: темы дизайна, адаптированные для встраивания витрины магазина в соцсеть в виде iframe-приложений, автоматическая авторизация пользователя соцсети в магазине (темы дизайна устанавливаются через Инсталлер; см. инструкцию на сайте Shop-Script)<br>
— Оптимизация экрана управления типами товаров и характеристик, позволяющие более удобно работать с очень большими количествами типов товаров, характеристик и их значений<br>
— Новый тип характеристики «Да/нет-переключатель (boolean)»<br>
— Модуль USPS: трекинг посылок в реальном времени и печатные формы<br>
— Модуль оплаты WorldPay<br>
— Несколько новых методов API Shop-Script для работы с характеристиками товаров";}i:13;a:2:{s:7:"version";s:11:"5.1.8.23275";s:7:"content";s:477:"Исправления ошибок, возникавших в некоторых конфигурациях интернет-магазина:<br>
— ошибки сортировки товаров внутри категорий<br>
— ошибки отображения информации об остатках на складе для артикула по умолчанию<br>
— небольшие дополнения в отдельных методах API";}i:14;a:2:{s:7:"version";s:11:"5.1.8.23222";s:7:"content";s:693:"— API для работы с товарами и категориями<br />
— Общие улучшения в работе: автоматическая фильтрация списка вариантов характеристик во фронтенд-фильтре товаров внутри категорий в зависимости от содержимого категорий, AJAX-дерево категорий в бекенде для работы с очень большими деревьями (ранее загружалось все дерево сразу), множественные улучшения, исправления найденных ошибок";}i:15;a:2:{s:7:"version";s:11:"5.1.7.23050";s:7:"content";s:315:"<p>Доступны для установки новые модули интеграции с сервисами расчета доставки и оплаты:</p>
<ul>
<li>Authorize.Net SIM</li>
<li>FedEx</li>
<li>UPS</li>
<li>USPS</li>
</ul>
<p>Исправление мелких недочетов.</p>";}i:16;a:2:{s:7:"version";s:11:"5.1.7.22987";s:7:"content";s:159:"Незначительные изменения в CSS тем дизайна для улучшения отображения на iPad и в Internet Explorer";}i:17;a:2:{s:7:"version";s:11:"5.1.7.22954";s:7:"content";s:930:"<ul>
<li>Добавлены 3 новых темы дизайна: Clear, Sidebar, Nifty</li>
<li>Добавлено отображение адресов обратных вызовов для платежных систем (callback URL) в настройках соответствующих модулей оплаты</li>
<li>Улучшена обработка обратных вызовов от платежных систем и смены статуса заказа в зависимости от ответа платежной систем ы</li>
<li>Улучшена обработка наличия на складе и доступности для заказа добавленных в корзину товаров</li>
<li>Добавлен хук backend_order</li>
<li>Оптимизация системных функций, исправление обнаруженных ошибок</li>
</ul>";}i:18;a:2:{s:7:"version";s:11:"5.1.6.22769";s:7:"content";s:1730:"<ul>
<li>Поддержка возможности обмена данными с «1С: Управление торговлей» версии 11</li>
<li>Модуль приема платежей через «<a href="http://privat24.ua" target="_blank">Приват24</a>»</li>
<li>Оформление заказов: 1) Улучшения в интерфейсе настройки формы ввода контактной информации, 2) Поле «Список (radio)»: возможность скрывать отдельные поля формы при определенных выбранных значениях, 3) Возможность отключать проверку заполнения полей контактной информации при оформлении заказа в бекенде (администратором магазина), 4) Согласие с Условиями предоставление услуг магазина.</li>
<li>Улучшения в шаблонах тем дизайна «Дефолт» и CUSTOM: 1) Незначительные улучшения в CSS и исправления ошибок работы в браузере Internet Explorer, 2) Шаблоны дизайна оформления заказа checkout.*.html: изменения, направленные на улучшение процесса оформления заказа, обработки ошибочных ситуаций и т.п.</li>
<li>Исправление ошибок, множественные улучшения, направленные на повышение общей стабильности работы продукта.</li>
</ul>";}i:19;a:2:{s:7:"version";s:11:"5.1.5.22480";s:7:"content";s:396:"<ul>
<li>Исправлена ошибка оформления заказа в браузере Internet Explorer 9 при использовании темы дизайна «CUSTOM».</li>
<li>Исправлена ошибка добавления товаров в корзину при включенном режиме продажи «Выбор характеристик».</li>
</ul>";}i:20;a:2:{s:7:"version";s:11:"5.1.5.22467";s:7:"content";s:1937:"<ul>
<li>добавлена функция обмена данными с «1С: Управление торговлей»</li>
<li>добавлена поддержка транзакций Google Analytics</li>
<li>добавлен плагин для наложения водяных знаков на загружаемые изображения товаров</li>
<li>добавлен плагин доставки «Самовывоз»</li>
<li>добавлены плагины для приема платежей через системы RBK Money и ASSIST</li>
<li>добавлена возможность редактирования комментария к заказу</li>
<li>добавлено поле для ввода дополнительных параметров страницы товара</li>
<li>в темах дизайна «Дефолт» и CUSTOM оформление витрины для стационарных и мобильных устройств изменяется в зависимости от ширины окна браузера</li>
<li>добавлена возможность настройки полного и неполного полей адреса, запрашиваемых в шаге выбора способа доставки, если адрес покупателя еще не указан</li>
<li>доработан интерфейс редактирования полей адреса в настройке оформления заказов</li>
<li>в шпаргалке редактора дизайна добавлены описания новых хелперов для получения данных</li>
<li>улучшена фильтрация результатов поиска товаров</li>
<li>незначительные улучшения и исправления найденных ошибок</li>
</ul>";}i:21;a:2:{s:7:"version";s:11:"5.1.4.22205";s:7:"content";s:2090:"<ul>
<li>Добавлена функция пакетной загрузки изображений с возможностью массового создания новых товаров  и присвоения загруженных изображений существующим товарам (см. раздел «Импорт/экспорт»).</li>
<li>Добавлена возможность загрузки изображений при импорте товаров из CSV-файла.</li>
<li>Улучшено соответствие тем дизайна требованиям W3C к валидации HTML-документов.</li>
<li>В теме дизайна CUSTOM добавлена возможность оформления заказа на одной странице (AJAX-чекаут).</li>
<li>Для модулей доставки добавлена функция запроса необходимых полей адреса покупателя, обязательных для работы данного модуля.</li>
<li>Добавлена возможность выбора способов доставки, доступных для каждого настроенного способа оплаты.</li>
<li>Добавлена возможность скрыть отдельные способы доставки, способы оплаты и категории товаров на данной витрине.</li>
<li>В диалоге редактирования свойств категорий товаров добавлен WYSIWYG/HTML-редактор.</li>
<li>Для модуля доставки «Курьер» добавлена печатная форма «Лист доставки».</li>
<li>В поле редактирования текстов уведомлений и отложенных сообщений добавлен список доступных переменных.</li>
<li>Исправления ошибок и незначительные улучшения.</li>
</ul>";}i:22;a:2:{s:7:"version";s:11:"5.1.3.21833";s:7:"content";s:784:"<ul>
<li>Исправлены ошибки импорта и экспорта тегов и множественных значений характеристик товаров и другие ошибки, возникавшие при импорте CSV-файла.</li>
<li>Исправлены ошибки верстки в браузере Safari.</li>
<li>Исправлена ошибка добавления товара в корзину при использовании темы дизайна «ДЕФОЛТ» и режима продажи товаров с выбором характеристик.</li>
<li>Добавлен учет скидки при расчете налогов.</li>
<li>Уменьшено потребление памяти.</li>
</ul>";}i:23;a:2:{s:7:"version";s:11:"5.1.3.21776";s:7:"content";s:597:"<ul><li>Добавлена функция экспорта товаров в CSV-файл.</li>
<li>Добавлен режим автоматического создания артикулов товара на основании выбранных сочетаний дополнительных характеристик.</li>
<li>В настройках динамических категорий  добавлен фильтр по цене товаров.</li>
<li>Улучшения в темах витрины.</li>
<li>Исправления мелких ошибок.</li>
</ul>";}i:24;a:2:{s:7:"version";s:11:"5.1.2.21608";s:7:"content";s:108:"Исправлена ошибка расчета суммы НДС при оформлении заказа.";}i:25;a:2:{s:7:"version";s:11:"5.1.2.21605";s:7:"content";s:1652:"<ul>
  <li>Добавлен плагин расчета стоимости и времени доставки «EMS Почта России» через API сервиса (http://www.emspost.ru/).</li>
  <li>Добавлены плагины интеграции с платежными системами Liqpay и Интеркасса.</li>
  <li>Улучшения интерфейса управления товарами: добавление и удаление товаров из категорий и списков с помощью пунктов в правом вертикальном меню, массовое присвоение тегов выбранным товарам.</li>
  <li>Добавлена версия страницы заказа, адаптированная для печати (доступна по ссылке «Печать»).</li>
  <li>Добавлена возможность авторизации зарегистрированного покупателя во время оформления заказа (в виде переключателя на странице ввода контактной информации).</li>
  <li>Добавлена возможность переключать вид отображения дерева категорий в шаблоне темы оформления: полностью раскрыты все категории либо раскрыта только выбранная часть дерева.</li>
  <li>Улучшения интерфейса бекенда, исправления недочетов и ошибок.</li>
</ul>";}i:26;a:2:{s:7:"version";s:11:"1.0.0.21449";s:7:"content";s:923:"<ul>
<li>Добавлена возможность импорта товаров из CSV-файла</li>
<li>Добавлена возможность отправки SMS-уведомлений о действиях с заказами; сообщения отправляются средствами плагинов, устанавливаемых через «Инсталлер»</li>
<li>Добавлен плагин отправки SMS-сообщений через sms.ru</li>
<li>Добавлена возможность скрывать товары и категории для показа на витрине магазина</li>
<li>Добавлены новые хуки для подключения плагинов на витрине: frontend_category и frontend_search</li>
<li>Многочисленные улучшения и исправления мелких ошибок</li>
</ul>";}i:27;a:2:{s:7:"version";s:11:"1.0.0.21252";s:7:"content";s:869:"
<ul>
<li>Отчеты: возможность просмотра данных за все время и за произвольно выбранный интервал времени</li>
<li>Импорт из WebAsyst Shop-Script: импорт купонов на скидку и артикулов товаров</li>
<li>Отзывы о товарах: в общих настройках магазина появилась возможность закрыть форму добавления отзыва капчей и отключить возможность публикации отзывов для неавторизованных пользователей</li>
<li>Незначительные исправления в печатных формах для заказов</li>
<li>Исправления найденных ошибок</li>
</ul>";}i:28;a:2:{s:7:"version";s:11:"1.0.0.21191";s:7:"content";s:77:"Исправления найденных ошибок и недочетов.";}i:29;a:2:{s:7:"version";s:11:"1.0.0.21184";s:7:"content";s:220:"<ul>
<li>Выбор дефолтной схемы для Gravatar-юзерпиков</li>
<li>Исправлены некоторые ошибки работы приложения в браузере Opera</li>
</ul>";}i:30;a:2:{s:7:"version";s:11:"1.0.0.21174";s:7:"content";s:133:"<ul>
<li>Поддержка Gravatar-юзерпиков</li>
<li>Исправления найденных ошибок</li>
</ul>";}i:31;a:2:{s:7:"version";s:11:"1.0.0.21154";s:7:"content";s:866:"<ul>
<li>Оптимизация скорости работы витрины</li>
<li>На странице ввода контактной информации при оформлении заказа добавлены возможность зарегистрироваться и отображение информации о текущем сеансе для авторизованных покупателей</li>
<li>Улучшена разметка страницы контакта в соответствии со стандартами микроформатов Schema.org</li>
<li>Мелкие улучшения верстки шаблонов печатных форм: счет-фактура, накладная, бланки Почты России №113, №116</li>
<li>Исправления найденных ошибок</li>
</ul>";}i:32;a:2:{s:7:"version";s:11:"1.0.0.21119";s:7:"content";s:903:"<ul>
<li>Фильтр списка заказов «В обработке», который показывает заказы в статусах «Новый», «Подтвержден» и «Оплачен»</li>
<li>Счетчик новых заказов на основной иконке приложения</li>
<li>Плагин импорта данных из WebAsyst Shop-Script: настройка «Сохранять ID», при включении которой идентификаторы товаров и категорий при импорте будут гарантированно сохранены (необходимо для правильной настройки редиректа, если ранее использовался формат адресов вида index.php?productID=#)</li>
<li>Исправления найденных ошибок</li>
</ul>";}i:33;a:2:{s:7:"version";s:11:"1.0.0.21080";s:7:"content";s:281:"Поиск товаров по артикулу.<br>
Добавлена кнопка "В корзину" в списках товаров.<br>
Исправлены ошибки в отчётах.<br>
Исправлен плагин экспорта в Яндекс.Маркет.";}i:34;a:2:{s:7:"version";s:11:"1.0.0.21041";s:7:"content";s:2696:"<ul>
    <li>Улучшен интерфейс обработки заказов.</li>
    <li>Добавлена отдельная версия страницы просмотра одного заказа вместе со списком заказов, адаптированная для мобильных устройств с сенсорным экраном.</li>
    <li>В настройки складов добавлен выбор действия, выполнение которого приводит к заказанных единиц товара.</li>
    <li>Добавлены новые отчеты: продажи, прибыль, популярные товары.</li>
    <li>Добавлено автоматическое формирование файла Sitemaps для витрины.</li>
    <li>В режиме редактирования заказа добавлена возможность выбора склада, с которого следует выполнить списание.</li>
    <li>Добавлена возможность загрузить файл для каждой вариации товара, который покупатель сможет скачать после оплаты заказа (продажа электронных товаров).</li>
    <li>Добавлены новые плагины формирования печатных форм для Shop-Script 5: накладная, счет-фактура (устанавливаются через «Инсталлер»).</li>
    <li>В модуль расчета стоимости доставки Почтой России добавлены печатные формы №113 и №116.</li>
    <li>Добавлен плагин «Бренды» для фильтрации товаров по брендам на витрине. Может использоваться в качестве примера написания собственного плагина для Shop-Script 5.</li>
    <li>Добавлен плагин «301 redirect», выполняющий перенаправление трафика со старых адресов страниц витрины WebAsyst Shop-Script (обычных и ЧПУ) на адреса страниц витрины Shop-Script 5. Плагин предназначен для удобного перехода с WebAsyst Shop-Script на Shop-Script 5.</li>
    <li>Улучшен механизм импорта данных из WebAsyst Shop-Script в плагине «Переход на Shop-Script».</li>
    <li>Исправления ошибок.</li>
</ul>";}i:35;a:2:{s:7:"version";s:11:"1.0.0.20686";s:7:"content";s:1569:"— Партнерская программа: начисление бонусов покупателям за собственные заказы, получение скидки за счет использования бонусов.<br>
— Фоллоу-апы: функция отправки email-уведомлений (например, рекламного характера) через определенный промежуток времени после оплаты заказа.<br>
— Добавлены хуки для подключения плагинов к основным разделам бекенда магазина.<br>
— Добавлена возможность выбора параметра сортировки товаров в списках на витрине магазина.<br>
— Отображение информации о складских остатках товара на витрине.<br>
— Добавлены модули оплаты по квитанции для физлиц и по счету для юрлиц (устанавливаются через «Инсталлер»).<br>
— Экспорт в Яндекс.Маркет (плагин устанавливается через «Инсталлер»).<br>
— В теме CUSTOM добавлено отображение списка специальных предложений в виде слайдера (на основе jQuery bxSlider).<br>
— Исправление ошибок и оптимизация кода.<br>";}i:36;a:2:{s:7:"version";s:11:"1.0.0.20674";s:7:"content";s:649:"<ul>
<li>Улучшения в дефолтной теме дизайна: личный кабинет покупателя, CSS для мобильных устройств, JS-корзина</li>
<li>Тема дизайна CUSTOM для Shop-Script (устанавливается через Инсталлер)</li>
<li>Модули оплаты: Яндекс.Деньги, Робокасса, PayOnline System, Assist (устанавливаются через Инсталлер)</li>
<li>Повышена общая стабильность работы продукта, исправление найденных ошибок</li>
</ul>";}i:37;a:2:{s:7:"version";s:11:"1.0.0.20555";s:7:"content";s:283:"Добавлены новые виды скидок: <ul> <li>процент от суммы текущего заказа;</li> <li>процент от общей суммы всех заказов покупателя.</li> </ul> Исправлены мелкие недочёты.";}i:38;a:2:{s:7:"version";s:11:"1.0.0.20452";s:7:"content";s:598:"Обновлена тема дизайна «ДЕФОЛТ»:
<ul>
<li>добавлены новые хуки для подключения плагинов;</li>
<li>улучшена вёрстка для соответствия схемам Schema.org;</li>
<li>исправлены мелкие ошибки и сделаны визуальные улучшения.</li>
</ul>
Добавлено текстовое поле для сохранения комментариев к купонам на скидку.<br>
Исправлены ошибки в бекенде магазина.";}i:39;a:2:{s:7:"version";s:11:"1.0.0.20151";s:7:"content";s:2174:"<ul>
<li>Добавлен раздел «Уведомления» для настройки email-уведомлений о новых заказах, изменениях статуса заказа и т. д.</li>
<li>Добавлена поддержка зависимых полей контактов, список значений которых зависит от значений других полей. Например, список станций метро в зависимости от выбранного города — используется для настройки процедуры оформления заказа.</li>
<li>Добавлена возможность авторизации через социальные сети при публикации отзыва к товару на витрине.</li>
<li>Выбранная наклейка (например, «Новинка!») распространяется на все изображения товара.</li>
<li>Добавлен модуль оплаты WebMoney (можно установить через Инсталлер в разделе «Плагины»).</li>
<li>Добавлен новый тип адресов страниц товаров и категорий — «Естественный». Его можно выбрать в настройках поселения магазина.</li>
<li>Добавлена возможность указать «старую» цену для каждой вариации товара. «Старая» цена отображается на витрине зачёркнутой — рядом с обычной ценой.</li>
<li>Исправления и улучшения темы дизайна: отображение блоков перекрёстных продаж и списков альтернативных товаров (upselling), отображение рейтинга товаров, автоматическая загрузка содержимого (lazy loading) и др.</li>
<li>Мелкие улучшения и исправления недочётов.</li>
</ul>";}}s:4:"size";N;s:12:"requirements";a:1:{s:13:"app.installer";a:2:{s:7:"version";s:13:">=1.2.0.25555";s:6:"strict";b:1;}}s:10:"is_premium";b:0;s:5:"theme";N;}}